#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <windows.h>
int main()
{
	system("title 学生成绩管理系统    ——by：刘亚星"); 
	char str[3];
	printf("******************************************************************************\n");
	printf("------------------------<<欢迎您使用学生成绩管理系统>>------------------------\n");
	printf("******************************************************************************\n");
	printf("                     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	printf("                     ┃            请选择功能           ┃\n");
	printf("                     ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┫\n");
	printf("                     ┃    ①.进入学生成绩管理系统      ┃\n");
	printf("                     ┃    ②.管理员设置                ┃\n");
	printf("                     ┃    ③.退出系统                  ┃\n");
	printf("                     ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");
	printf("                          请输入您的选择(1--3):( )\b\b");
	gets(str);
	if(atoi(str)>3 || atoi(str)<1)
	{
		do{
			system("cls");
			printf("******************************************************************************\n");
			printf("------------------------<<欢迎您使用学生成绩管理系统>>------------------------\n");
			printf("******************************************************************************\n");
			printf("                     ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
			printf("                     ┃            请选择功能           ┃\n");
			printf("                     ┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┫\n");
			printf("                     ┃    ①.进入学生成绩管理系统      ┃\n");
			printf("                     ┃    ②.管理员设置                ┃\n");
			printf("                     ┃    ③.退出系统                  ┃\n");
			printf("                     ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");
			printf("                          对不起,请输入1-3这几个数字!!\n");
			printf("                          请输入您的选择(1--3):( )\b\b");
			gets(str);
		}while(atoi(str)>3 || atoi(str)<1);
	}
	int ch=atoi(str);
	switch(ch) {
		case 1:
			system("start main.exe");
			break;
		case 2:
			system("start manage.exe");
			break;
		case 3:
			printf("******************************************************************************\n");
			printf("------------------------<<谢谢您使用学生成绩管理系统>>------------------------\n");
			printf("******************************************************************************\n");
			Sleep(1500); 
			break;
	}
	return 0;
 } 

